import React from 'react';
import css from '../styles/info.module.scss';
import NovaPoshtaIcon from '../icons/NovaPoschtaIcon';
import { MainLayout } from '../layouts/MainLayout';

const Info: React.FC = () => {
  return (
    <MainLayout title={'доставка, оплата, повернення'}>
      <div className={css.deliveryPayment}>
        <h1>Доставка, оплата, повернення</h1>
        <div className={css.deliveryItem}>
          <NovaPoshtaIcon />
          <div className={css.deliveryItemTitle}>
            <div className={css.subtitle}>Доставка</div>
            <div className={css.deliveryDesc}>
              Новою Поштою в будь-який куточок України 1-3 дні.
            </div>
            <div className={css.deliveryItalic}>
              (Терміни відправлення товару, можуть змінюватись продавцем)
            </div>
          </div>
        </div>

        <div className={css.deliveryItem}>
          <div>
            <svg width="40" height="40" fill="#b3b3b3" viewBox="0 0 1024 1024"
                 style={{ display: 'flex', alignSelf: 'center' }}>
              <path stroke="#b3b3b3" strokeWidth="1"
                    d="M952.032 150.992h-880.064c-39.68 0-71.968 31.92-71.968 71.168v600.08c0 39.232 32.288 71.152 71.968 71.152h880.064c39.68 0 71.968-31.92 71.968-71.152v-600.080c0-39.248-32.288-71.168-71.968-71.168zM989.872 822.24c0 20.624-16.96 37.408-37.84 37.408h-880.064c-20.864 0-37.84-16.784-37.84-37.408v-600.080c0-20.624 16.96-37.408 37.84-37.408h880.064c20.864 0 37.84 16.8 37.84 37.408v600.080z M273.072 640.32h-153.6c-9.44 0-17.072 7.552-17.072 16.864s7.632 16.88 17.072 16.88h153.6c9.44 0 17.072-7.552 17.072-16.88-0.016-9.312-7.632-16.864-17.072-16.864z M494.928 640.32h-153.6c-9.44 0-17.072 7.552-17.072 16.864s7.632 16.88 17.072 16.88h153.6c9.44 0 17.072-7.552 17.072-16.88 0-9.312-7.632-16.864-17.072-16.864z M136.528 724.672h-17.056c-9.44 0-17.072 7.552-17.072 16.88 0 9.312 7.632 16.88 17.072 16.88h17.072c9.44 0 17.072-7.568 17.072-16.88-0.016-9.328-7.648-16.88-17.088-16.88z M238.928 724.672h-34.128c-9.44 0-17.072 7.552-17.072 16.88 0 9.312 7.632 16.88 17.072 16.88h34.128c9.44 0 17.072-7.568 17.072-16.88 0-9.328-7.632-16.88-17.072-16.88z M324.272 724.672h-17.072c-9.44 0-17.072 7.552-17.072 16.88 0 9.312 7.632 16.88 17.072 16.88h17.072c9.44 0 17.072-7.568 17.072-16.88-0.016-9.328-7.632-16.88-17.072-16.88z M426.672 724.672h-34.128c-9.44 0-17.072 7.552-17.072 16.88 0 9.312 7.632 16.88 17.072 16.88h34.128c9.44 0 17.072-7.568 17.072-16.88-0.016-9.328-7.648-16.88-17.072-16.88z M482.816 729.568c-3.088 3.2-4.944 7.6-4.944 11.984s1.856 8.768 4.944 11.968c3.232 3.040 7.68 4.896 12.112 4.896s8.88-1.856 12.112-4.896c3.088-3.2 4.96-7.6 4.96-11.968 0-4.384-1.872-8.784-4.944-11.984-6.496-6.24-18.112-6.24-24.24 0z M819.2 572.816c-21.776 0-42.128 5.888-59.728 15.968-17.6-10.080-37.952-15.968-59.728-15.968-65.856 0-119.472 52.976-119.472 118.096 0 65.136 53.616 118.112 119.472 118.112 21.776 0 42.144-5.888 59.728-15.968 17.6 10.080 37.952 15.968 59.728 15.968 65.856 0 119.472-52.976 119.472-118.112 0-65.12-53.616-118.096-119.472-118.096zM785.072 690.928c0 23.52-9.824 44.784-25.6 60.096-15.776-15.312-25.6-36.576-25.6-60.096s9.824-44.784 25.6-60.096c15.76 15.312 25.6 36.576 25.6 60.096zM614.4 690.928c0-46.512 38.288-84.368 85.328-84.368 10.768 0 20.992 2.192 30.496 5.824-18.896 20.896-30.496 48.384-30.496 78.544 0 30.176 11.6 57.664 30.496 78.544-9.504 3.632-19.728 5.824-30.496 5.824-47.040 0-85.328-37.856-85.328-84.368zM819.2 775.296c-10.768 0-20.992-2.192-30.496-5.824 18.896-20.88 30.496-48.368 30.496-78.544s-11.6-57.648-30.496-78.544c9.504-3.616 19.728-5.824 30.496-5.824 47.056 0 85.328 37.856 85.328 84.368s-38.272 84.368-85.328 84.368z M140.88 522.192h230.224c21.216 0 38.48-17.072 38.48-38.048v-160.144c0-20.96-17.264-38.032-38.48-38.032h-230.224c-21.216 0-38.48 17.072-38.48 38.032v160.16c-0 20.976 17.264 38.032 38.48 38.032zM204.8 420.96h-68.272v-33.744h68.272v33.744zM136.528 484.16v-29.44h68.272v29.44c0 1.456 0.272 2.864 0.448 4.304h-64.368c-2.4-0.016-4.352-1.936-4.352-4.304zM375.456 420.96h-68.256v-29.44c0-2.384 1.952-4.304 4.352-4.304h59.568c1.488 0 2.896-0.272 4.352-0.432v34.176zM371.12 488.448h-64.368c0.176-1.44 0.448-2.832 0.448-4.304v-29.44h68.272v29.44c-0.016 2.384-1.952 4.304-4.352 4.304zM371.12 319.728c2.4 0 4.352 1.92 4.352 4.288v25.152c0 2.368-1.952 4.304-4.352 4.304h-59.568c-21.216 0-38.48 17.088-38.48 38.064v92.624c0 2.368-1.952 4.304-4.352 4.304h-25.424c-2.4 0-4.352-1.92-4.352-4.304v-160.144c0-2.368 1.952-4.288 4.352-4.288h127.824zM140.88 319.728h64.352c-0.16 1.44-0.448 2.832-0.448 4.288v29.44h-68.256v-29.44c0-2.368 1.952-4.288 4.352-4.288z" />
            </svg>
          </div>
          <div className={css.deliveryItemTitle}>
            <div className={css.subtitle}>Оплата</div>
            <div className={css.deliveryDesc}>
              Банківською картою VISA або Master Card на нашому сайті або при отриманні замовлення накладеним платежем.
            </div>
          </div>
        </div>

        <div className={css.deliveryItem}>
          <div>
            <svg width="40" height="40" fill="#b3b3b3" viewBox="0 0 1024 1024"
                 style={{ display: 'flex', alignSelf: 'center' }}>
              <path stroke="#b3b3b3" strokeWidth="1"
                    d="M888.592 325.248c-10.464-13.664-20.32-26.56-24.16-38.368-4.144-12.72-3.824-29.536-3.472-47.328 0.528-27.552 1.136-58.768-16.512-82.976-17.824-24.432-47.936-33.488-74.496-41.504-16.944-5.12-32.944-9.92-43.552-17.632-10.384-7.536-19.792-21.104-29.744-35.472-15.904-22.912-33.92-48.896-63.104-58.336-28.048-9.088-56.080 0.608-83.2 9.952-17.136 5.92-33.312 11.52-47.184 11.52-13.856 0-30.048-5.6-47.184-11.52-27.104-9.36-55.136-19.056-83.184-9.952-29.2 9.456-47.216 35.424-63.12 58.352-9.952 14.352-19.36 27.92-29.744 35.456-10.608 7.712-26.624 12.528-43.568 17.632-26.56 8-56.672 17.072-74.48 41.504-17.648 24.192-17.056 55.424-16.528 82.976 0.336 17.808 0.672 34.608-3.472 47.328-3.84 11.808-13.712 24.704-24.16 38.368-17.056 22.304-36.4 47.584-36.4 78.736 0 31.168 19.328 56.432 36.4 78.736 10.448 13.664 20.32 26.56 24.16 38.368 4.144 12.72 3.824 29.536 3.472 47.328-0.528 27.552-1.136 58.768 16.528 82.96 9.328 12.8 22.048 21.36 35.84 27.776v321.36c0 6.752 3.088 13.12 8.384 17.312s12.24 5.744 18.816 4.192l278.224-65.136 278.224 65.136c1.68 0.384 3.376 0.576 5.056 0.576 4.944 0 9.792-1.648 13.744-4.768 5.296-4.176 8.384-10.56 8.384-17.312v-321.328c13.792-6.432 26.512-14.976 35.84-27.792 17.648-24.192 17.056-55.408 16.528-82.96-0.336-17.808-0.672-34.624 3.472-47.344 3.84-11.808 13.712-24.704 24.16-38.368 17.056-22.304 36.4-47.584 36.4-78.752 0.016-31.136-19.312-56.416-36.368-78.72z" />
            </svg>
          </div>
          <div className={css.deliveryItemTitle}>
            <div className={css.subtitle}>Перевірка якості</div>
            <div className={css.deliveryDesc}>
              Отримуючи товар на пошті, ви маєте право перш ніж оплачувати замовлення, приміряти, подивитися і оцінити
              наскільки якість замовленої продукції влаштовує вас. Чи підходить вам розмір і фасон, чи відповідає вашому
              очікуванню.
            </div>
          </div>
        </div>

        <div className={css.deliveryItem}>
          <div>
            <svg width="40" height="40" fill="#b3b3b3" viewBox="0 0 1024 1024"
                 style={{ display: 'flex', alignSelf: 'center' }}>
              <path stroke="#b3b3b3" strokeWidth="1"
                    d="M512 0c-282.976 0-512 228.992-512 512 0 282.976 228.992 512 512 512 282.976 0 512-229.008 512-512s-228.992-512-512-512zM512 955.728c-244.672 0-443.728-199.056-443.728-443.728s199.056-443.744 443.728-443.744c244.672 0 443.744 199.072 443.744 443.744-0.016 244.672-199.072 443.728-443.744 443.728z M512 773.552c-219.84 0-337.504-252.176-207.6-420.896l6.352 6.352c18.48 18.48 50.288 10.176 57.104-15.296l23.472-87.584c6.8-25.376-16.48-48.608-41.808-41.808l-87.6 23.472c-25.36 6.8-33.84 38.56-15.296 57.104l9.168 9.168c-172.112 211.392-25.040 537.744 256.208 537.744 18.848 0 34.128-15.28 34.128-34.128s-15.28-34.128-34.128-34.128z M768.208 719.952c172.112-211.408 25.040-537.776-256.208-537.776-18.848 0-34.144 15.28-34.144 34.128s15.28 34.128 34.144 34.128c219.84 0 337.504 252.176 207.6 420.896l-6.352-6.352c-18.56-18.576-50.32-10.032-57.104 15.296l-23.472 87.584c-6.816 25.472 16.592 48.576 41.808 41.808l87.6-23.472c25.36-6.8 33.84-38.56 15.312-57.12l-9.184-9.12z" />
            </svg>
          </div>
          <div className={css.deliveryItemTitle}>
            <div className={css.subtitle}>Повернення обмін / товару</div>
            <div className={css.deliveryDesc}>
              Якщо вам не підійшов розмір, колір, або ж ви виявили інші проблеми, впродовж 14 днів після покупки, ви
              можете повернути нам товар або обміняти на інший.
              <br /><br />
              Потрібно подзвонити на сайт за цим номером:&nbsp;
              <a href="tel:+380632624137">063 262-41-37</a>,
              і в телефонному режимі ми оформимо обмін або повернення товару.
              <br /><br />
              Доставка оплачується покупцем, у разі повернення або обміну товару.
              <b> Якщо відправити повернення за допомогою послуги{' '}
                <a href="https://www.youtube.com/watch?v=v3InrTCPk5E" target="_blank" rel="noopener noreferrer">
                  {'"Легкого повернення"'}
                </a>
              </b> (тисни на посилання, щоб переглянути відео)
              <b> - доставка безкоштовна!</b>
              <br /><br />
              Повернення коштів або обмін відбувається упродовж 3-7 робочих днів після отримання нами товару, що
              повертається від вас на склад Нової Пошти. У разі виявлення браку виробництва, доставку оплачуємо ми.
              <br /><br />
              <p className={css.deliveryBold}>Умови повернення / обміну:</p>
              <ul>
                <li>відсутність ознак використання товару, забруднень, сторонніх запахів;</li>
                <li>наявність ярликів;</li>
                <li>збережений товарний вигляд.</li>
              </ul>
              У разі виявлення ознак використання товару, ми залишаємо за собою право на відмову у поверненні коштів.
            </div>
          </div>
        </div>
      </div>
    </MainLayout>
  );
};

export default Info;
